bolknote/MK61S_MINI/code/m61_text.cpp
#include "m61_text.hpp"

#include "bounded_string.hpp"
#include "mk61emu_core.h"
#include "program_store.hpp"
#include "stm32_sram_bit_band.hpp"
#include "terminal_core.hpp"
#include "terminal_script.hpp"

#ifndef M61_TEXT_HOST_TEST
#include "Arduino.h"
#include "library_pmk.hpp"
#include "storage_path.hpp"
#include "tools.hpp"
#else
bool OpenStoredFile(const char* args);
void hidden_start_loaded_program(void);
void MK61Emu_ClearCodePage(void);
void reinit_mk61_calculator_state(void);
u32 m61_text_host_millis(void);
#endif

#include <stdio.h>
#include <string.h>

namespace m61_text {

static constexpr u16 MAX_LINE_SIZE = (u16) terminal_core::MAX_INPUT_TEXT;
static constexpr u8 HIN_BYTES_PER_LINE = 24;
static constexpr u8 SCRIPT_STACK_DEPTH = 8;
static constexpr u8 SCRIPT_LINE_BUDGET = 8;
static constexpr u8 READ_CACHE_SIZE = 64;
static constexpr u8 MAX_LABELS = 64;
static constexpr u8 MAX_LABEL_SIZE = 31;
static constexpr u8 TRAP_ADDRESS_COUNT = (u8) core_61::MAX_PROGRAM_STEP;
static constexpr u8 TRAP_BITMAP_SIZE =
    (u8) ((core_61::MAX_PROGRAM_STEP + 7U) / 8U);
static constexpr u8 INVALID_TRAP_TARGET = 0xFF;
static constexpr u8 MAX_BINDS = 8;
static constexpr u8 INVALID_BIND_OPCODE = 0xFF;
static constexpr u8 INVALID_BIND_TARGET = 0xFF;
static constexpr u8 RETURN_STACK_DEPTH = SCRIPT_STACK_DEPTH + 1;

enum class RunnerState : u8 {
  IDLE,
  EXECUTING,
  WAIT_RUN_STOP,
  WAIT_TIME,
  WATCH_EVENTS
};

enum class ScriptSource : u8 {
  NONE,
  STORE
};

struct ScriptFrame {
  ScriptSource source;
  char name[program_store::NAME_SIZE];
  u16 id;
  u16 len;
  u16 pos;
  u16 line;
  u8 active_traps[TRAP_BITMAP_SIZE];
  u8 active_bind_opcodes[MAX_BINDS];
};

enum class ReturnKind : u8 {
  SCRIPT,
  LABEL,
  TRAP,
  BIND
};

struct ReturnFrame {
  ReturnKind kind;
  RunnerState runner_state;
  ScriptFrame script;
};

struct LabelEntry {
  u32 hash;
  u16 name_pos;
  u16 target_pos;
  u16 target_line;
  u8 len;
};

struct BindEntry {
  u8 opcode;
  u8 target;
};

static RunnerState runner_state = RunnerState::IDLE;
static ScriptSource script_source = ScriptSource::NONE;
static char script_name[program_store::NAME_SIZE] = {};
static u16 script_id = program_store::INVALID_ID;
static u16 script_len = 0;
static u16 script_pos = 0;
static u16 script_line = 1;
#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
static volatile u8 active_traps[TRAP_BITMAP_SIZE] = {};
#else
static u8 active_traps[TRAP_BITMAP_SIZE] = {};
#endif
static ReturnFrame return_stack[RETURN_STACK_DEPTH];
static u8 return_stack_depth = 0;
static u8 script_stack_depth = 0;
static u8 read_cache[READ_CACHE_SIZE];
static u16 read_cache_start = 0;
static u8 read_cache_len = 0;
static LabelEntry labels[MAX_LABELS];
static u8 label_count = 0;
static u8 trap_targets[TRAP_ADDRESS_COUNT];
static BindEntry binds[MAX_BINDS];
static u8 bind_count = 0;
static u8 active_bind_opcodes[MAX_BINDS];
static core_61::Mk61CommandHookHandle bind_before_hooks[MAX_BINDS];
static core_61::Mk61CommandHookHandle bind_after_hooks[MAX_BINDS];
static bool trap_pending = false;
static u8 pending_trap_address = 0;
static u8 pending_trap_target = INVALID_TRAP_TARGET;
static bool trap_context_valid = false;
static core_61::ContextBuffer trap_context = {};
static u8 suspended_trap_address = 0;
static bool bypass_trap_once = false;
static u8 bypass_trap_address = 0;
static bool bind_pending = false;
static bool bind_ready = false;
static u8 pending_bind_target = INVALID_BIND_TARGET;
static u32 pending_bind_sequence = 0;
static bool bind_handler_active = false;
static bool boundary_hook_installed = false;
static bool display_claimed = false;
static u32 wait_until_ms = 0;
static bool has_error = false;
static Error last_error_info = {};
static const char* line_error_message = NULL;

static void bind_command_hook(
    core_61::Mk61CommandHookContext& context, void* user_data);

#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
static volatile u32* active_trap_bit_alias_base(void) {
  return stm32_sram_bit_band::alias_base(&active_traps[0]);
}

static void* active_trap_boundary_hook_data(void) {
  return reinterpret_cast<void*>(
      const_cast<u32*>(active_trap_bit_alias_base()));
}
#else
static void* active_trap_boundary_hook_data(void) {
  return NULL;
}
#endif

static void clear_active_traps(void) {
  for(u8 i = 0; i < TRAP_BITMAP_SIZE; i++) active_traps[i] = 0;
}

static void clear_active_binds(void) {
  for(u8 i = 0; i < MAX_BINDS; i++) {
    active_bind_opcodes[i] = INVALID_BIND_OPCODE;
  }
}

static void save_active_traps(u8 (&out)[TRAP_BITMAP_SIZE]) {
  for(u8 i = 0; i < TRAP_BITMAP_SIZE; i++) out[i] = active_traps[i];
}

static void save_active_binds(u8 (&out)[MAX_BINDS]) {
  for(u8 i = 0; i < MAX_BINDS; i++) out[i] = active_bind_opcodes[i];
}

static void restore_active_traps(const u8 (&saved)[TRAP_BITMAP_SIZE]) {
  for(u8 i = 0; i < TRAP_BITMAP_SIZE; i++) active_traps[i] = saved[i];
}

static void restore_active_binds(const u8 (&saved)[MAX_BINDS]) {
  for(u8 i = 0; i < MAX_BINDS; i++) active_bind_opcodes[i] = saved[i];
}

static bool bind_is_active(u8 opcode) {
  for(u8 i = 0; i < MAX_BINDS; i++) {
    if(active_bind_opcodes[i] == opcode) return true;
  }
  return false;
}

static bool any_bind_is_active(void) {
  for(u8 i = 0; i < MAX_BINDS; i++) {
    if(active_bind_opcodes[i] != INVALID_BIND_OPCODE) return true;
  }
  return false;
}

static i16 find_bind_index(u8 opcode) {
  for(u8 i = 0; i < bind_count; i++) {
    if(binds[i].opcode == opcode) return (i16) i;
  }
  return -1;
}

static void clear_bind_hooks(void) {
  for(u8 i = 0; i < MAX_BINDS; i++) {
    if(bind_before_hooks[i] != core_61::INVALID_MK61_COMMAND_HOOK) {
      (void) core_61::unregister_mk61_command_hook(bind_before_hooks[i]);
      bind_before_hooks[i] = core_61::INVALID_MK61_COMMAND_HOOK;
    }
    if(bind_after_hooks[i] != core_61::INVALID_MK61_COMMAND_HOOK) {
      (void) core_61::unregister_mk61_command_hook(bind_after_hooks[i]);
      bind_after_hooks[i] = core_61::INVALID_MK61_COMMAND_HOOK;
    }
  }
}

static bool sync_bind_hooks(void) {
  clear_bind_hooks();
  u8 hook_index = 0;
  for(u8 i = 0; i < MAX_BINDS; i++) {
    const u8 opcode = active_bind_opcodes[i];
    if(opcode == INVALID_BIND_OPCODE) continue;
    if(find_bind_index(opcode) < 0 || hook_index >= MAX_BINDS) {
      clear_bind_hooks();
      return false;
    }

    bind_before_hooks[hook_index] = core_61::register_mk61_command_hook(
        opcode, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
        &bind_command_hook, NULL);
    bind_after_hooks[hook_index] = core_61::register_mk61_command_hook(
        opcode, core_61::Mk61CommandHookPhase::AFTER_EXECUTE,
        &bind_command_hook, NULL);
    if(bind_before_hooks[hook_index] ==
           core_61::INVALID_MK61_COMMAND_HOOK ||
       bind_after_hooks[hook_index] ==
           core_61::INVALID_MK61_COMMAND_HOOK) {
      clear_bind_hooks();
      return false;
    }
    hook_index++;
  }
  return true;
}

// Снимок ловушки фиксирует всё состояние ядра, включая единицу угла. Однако
// Р/Г/ГРД на корпусе играют роль внешнего переключателя: изменение, сделанное
// пользователем, пока обработчик ловушки держит кадр, должно пережить `ret`.
static bool restore_trap_context(void) {
  const AngleUnit selected_angle = MK61Emu_GetAngleUnit();
  if(!core_61::restore_context(trap_context)) return false;
  MK61Emu_SetAngleUnit(selected_angle);
  return true;
}

static bool is_line_end(char c) {
  return c == 0 || c == '\r' || c == '\n';
}

