bolknote/MK61S_MINI/code/m61_text.cpp
static bool is_space(char c) {
  return c == ' ' || c == '\t';
}

static const char* skip_spaces(const char* p) {
  while(is_space(*p)) p++;
  return p;
}

static bool token_ends(const char* p) {
  p = skip_spaces(p);
  return is_line_end(*p);
}

static u32 runner_millis(void) {
#ifndef M61_TEXT_HOST_TEST
  return millis();
#else
  return m61_text_host_millis();
#endif
}

static bool time_reached(u32 now, u32 deadline) {
  return (i32) (now - deadline) >= 0;
}

static void clear_error(void) {
  has_error = false;
  memset(&last_error_info, 0, sizeof(last_error_info));
}

static void invalidate_read_cache(void) {
  read_cache_start = 0;
  read_cache_len = 0;
}

template<usize N>
static void copy_script_name(char (&out)[N], const char* name) {
  bounded_string::copy(out, name);
}

static void clear_current_script(void) {
  script_source = ScriptSource::NONE;
  script_name[0] = 0;
  script_id = program_store::INVALID_ID;
  script_len = 0;
  script_pos = 0;
  script_line = 1;
  invalidate_read_cache();
  label_count = 0;
  bind_count = 0;
  clear_active_traps();
  clear_active_binds();
  memset(trap_targets, INVALID_TRAP_TARGET, sizeof(trap_targets));
}

#ifdef M61_TEXT_HOST_TEST
static bool find_entry_by_type_name(program_store::ProgramType type, const char* name, program_store::Entry& out) {
  if(name == NULL || name[0] == 0) return false;
  const int count = program_store::count(type);
  for(int i = 0; i < count; i++) {
    program_store::Entry entry;
    if(!program_store::entry(type, i, entry)) continue;
    if(strncmp(entry.name, name, program_store::NAME_SIZE) == 0) {
      out = entry;
      return true;
    }
  }
  return false;
}
#endif

static void store_current_frame(ScriptFrame& frame) {
  frame.source = script_source;
  copy_script_name(frame.name, script_name);
  frame.id = script_id;
  frame.len = script_len;
  frame.pos = script_pos;
  frame.line = script_line;
  save_active_traps(frame.active_traps);
  save_active_binds(frame.active_bind_opcodes);
}

static void restore_frame(const ScriptFrame& frame) {
  script_source = frame.source;
  copy_script_name(script_name, frame.name);
  script_id = frame.id;
  script_len = frame.len;
  script_pos = frame.pos;
  script_line = frame.line;
  restore_active_traps(frame.active_traps);
  restore_active_binds(frame.active_bind_opcodes);
  invalidate_read_cache();
}

static bool make_store_frame(u16 id, ScriptFrame& frame) {
  program_store::Entry entry;
  if(!program_store::entry_by_id(id, entry) ||
     entry.kind != program_store::NodeKind::FILE ||
     entry.type != program_store::ProgramType::MK61) return false;
  frame.source = ScriptSource::STORE;
  copy_script_name(frame.name, entry.name);
  frame.id = entry.id;
  frame.len = entry.data_len;
  frame.pos = 0;
  frame.line = 1;
  memset(frame.active_traps, 0, sizeof(frame.active_traps));
  memset(frame.active_bind_opcodes, INVALID_BIND_OPCODE,
         sizeof(frame.active_bind_opcodes));
  return true;
}

static bool make_store_frame(const char* name, ScriptFrame& frame) {
  if(name == NULL || name[0] == 0) return false;

#ifndef M61_TEXT_HOST_TEST
  // Имена вложенных сценариев сначала разрешаются в каталоге вызывающего
  // сценария. Это изолирует одноимённые сценарии в независимых деревьях
  // каталогов и позволяет использовать обычные относительные пути
  // (../lib/tool.m61).
  u16 cwd = program_store::ROOT_ID;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) cwd = current.parent_id;
  }

  program_store::Entry entry;
  if(storage_path::resolve_file(cwd, name,
      program_store::ProgramType::MK61, entry) == storage_path::Status::OK) {
    return make_store_frame(entry.id, frame);
  }

  // Раньше простые имена без пути считались глобальными. Сохраняем этот
  // запасной вариант, но не превращаем явно относительный путь в поиск
  // несвязанного файла в корневом каталоге.
  if(cwd != program_store::ROOT_ID && strchr(name, '/') == NULL &&
     strchr(name, '\\') == NULL &&
     storage_path::resolve_file(program_store::ROOT_ID, name,
       program_store::ProgramType::MK61, entry) == storage_path::Status::OK) {
    return make_store_frame(entry.id, frame);
  }
  return false;
#else
  program_store::Entry entry;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) {
      const int count = program_store::child_count(current.parent_id);
      for(int i = 0; i < count; i++) {
        program_store::Entry candidate;
        if(program_store::child(current.parent_id, i, candidate) &&
           candidate.kind == program_store::NodeKind::FILE &&
           candidate.type == program_store::ProgramType::MK61 &&
           strncmp(candidate.name, name, program_store::NAME_SIZE) == 0) {
          return make_store_frame(candidate.id, frame);
        }
      }
    }
  }

  return find_entry_by_type_name(program_store::ProgramType::MK61, name, entry) &&
         make_store_frame(entry.id, frame);
#endif
}

static bool push_current_frame(ReturnKind kind) {
  if(return_stack_depth >= RETURN_STACK_DEPTH ||
     script_source == ScriptSource::NONE) return false;
  if(kind == ReturnKind::SCRIPT && script_stack_depth >= SCRIPT_STACK_DEPTH) {
    return false;
  }
  ReturnFrame& frame = return_stack[return_stack_depth++];
  frame.kind = kind;
  frame.runner_state = runner_state;
  store_current_frame(frame.script);
  if(kind == ReturnKind::SCRIPT) script_stack_depth++;
  return true;
}

bool active(void) {
  return runner_state != RunnerState::IDLE;
}

bool calculator_suspended(void) {
  return trap_pending || trap_context_valid;
}

bool display_owned(void) {
  return active() && display_claimed;
}

void claim_display(void) {
  if(active()) display_claimed = true;
}

void release_display(void) {
  display_claimed = false;
}

static void clear_trap_runtime(bool restore_calculator) {
  if(restore_calculator && trap_context_valid) {
    (void) restore_trap_context();
  }
  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  trap_context_valid = false;
  suspended_trap_address = 0;
  bypass_trap_once = false;
  bypass_trap_address = 0;
}

static void clear_bind_runtime(void) {
  bind_pending = false;
  bind_ready = false;
  pending_bind_target = INVALID_BIND_TARGET;
  pending_bind_sequence = 0;
  bind_handler_active = false;
}

static void stop_runner(void) {
  clear_trap_runtime(true);
  clear_bind_runtime();
  clear_bind_hooks();
  if(boundary_hook_installed) {
    core_61::clear_mk61_program_boundary_hook();
    boundary_hook_installed = false;
  }
  runner_state = RunnerState::IDLE;
  display_claimed = false;
  wait_until_ms = 0;
  clear_current_script();
  return_stack_depth = 0;
  script_stack_depth = 0;
}

void cancel(void) {
  stop_runner();
  clear_error();
}

bool last_error(Error& out) {
  out = last_error_info;
  return has_error;
}

