bolknote/MK61S_MINI/code/m61_text.cpp
static void fail_script(const char* message, u16 line) {
  copy_script_name(last_error_info.script, script_name);
  last_error_info.line = line;
  bounded_string::copy(last_error_info.message,
                       message == NULL ? "unknown error" : message);
  stop_runner();
  has_error = true;
#ifndef M61_TEXT_HOST_TEST
  Serial.print("M61 error in ");
  Serial.print(last_error_info.script);
  if(line != 0) {
    Serial.print(" at line ");
    Serial.print(line);
  }
  Serial.print(": ");
  Serial.println(last_error_info.message);
#endif
}

static bool read_script_byte(u8& value, bool& eof) {
  eof = false;
  if(script_pos >= script_len) {
    eof = true;
    return true;
  }

  if(script_source == ScriptSource::STORE) {
    if(script_pos < read_cache_start || script_pos >= (u16) (read_cache_start + read_cache_len)) {
      read_cache_start = script_pos;
      const u16 remaining = (u16) (script_len - script_pos);
      const u16 wanted = remaining < READ_CACHE_SIZE ? remaining : READ_CACHE_SIZE;
      u16 got = 0;
      if(!program_store::read_range_id(script_id, read_cache_start, read_cache,
                                       wanted, &got) || got == 0) {
        read_cache_len = 0;
        return false;
      }
      read_cache_len = (u8) got;
    }
    value = read_cache[script_pos - read_cache_start];
    script_pos++;
    return true;
  }

  return false;
}

static bool read_next_line(char* line, u16 capacity) {
  if(line == NULL || capacity == 0) return false;

  u16 line_len = 0;
  while(true) {
    u8 value = 0;
    bool eof = false;
    if(!read_script_byte(value, eof)) return false;
    if(eof) {
      line[line_len] = 0;
      return line_len > 0;
    }

    const char c = (char) value;
    if(c == '\r') {
      // Принимаем CR и CRLF, не выдавая парный LF за пустую строку.
      if(script_pos < script_len) {
        u8 next = 0;
        bool next_eof = false;
        const u16 saved_pos = script_pos;
        if(!read_script_byte(next, next_eof)) return false;
        if(next_eof || next != '\n') script_pos = saved_pos;
      }
      line[line_len] = 0;
      script_line++;
      return true;
    }
    if(c == '\n' || c == 0) {
      line[line_len] = 0;
      script_line++;
      return true;
    }
    if(line_len + 1 >= capacity) return false;
    line[line_len++] = c;
  }
}

static u32 label_hash(const char* name, usize len) {
  u32 hash = 2166136261UL;
  for(usize i = 0; i < len; i++) {
    hash ^= (u8) name[i];
    hash *= 16777619UL;
  }
  return hash;
}

enum class LabelParse : u8 { NONE, VALID, INVALID };

static LabelParse parse_label(const char* line, const char*& name, usize& len) {
  const char* p = skip_spaces(line);
  if(*p != ':') return LabelParse::NONE;
  p = skip_spaces(p + 1);
  name = p;
  len = 0;
  while(!is_space(p[len]) && !is_line_end(p[len])) len++;
  if(len == 0 || len > MAX_LABEL_SIZE || !token_ends(p + len)) return LabelParse::INVALID;
  return LabelParse::VALID;
}

static bool stored_label_equals(const LabelEntry& entry, const char* name, usize len) {
  if(entry.len != len || entry.hash != label_hash(name, len)) return false;
  char stored[MAX_LABEL_SIZE + 1];
  u16 got = 0;
  if(!program_store::read_range_id(script_id, entry.name_pos, (u8*) stored,
                                   entry.len, &got) || got != entry.len) return false;
  return memcmp(stored, name, len) == 0;
}

static i16 find_label_index(const char* name, usize len) {
  const u32 hash = label_hash(name, len);
  for(u8 i = 0; i < label_count; i++) {
    if(labels[i].hash == hash && stored_label_equals(labels[i], name, len)) {
      return (i16) i;
    }
  }
  return -1;
}

enum class TrapParse : u8 { NONE, VALID, INVALID };

struct ParsedTrap {
  u8 address;
  const char* label;
  usize label_len;
};

static TrapParse parse_trap(const char* line, ParsedTrap& out) {
  const char* p = skip_spaces(line);
  static const char keyword[] = "trap";
  if(strncmp(p, keyword, sizeof(keyword) - 1) != 0 ||
     (!is_space(p[sizeof(keyword) - 1]) &&
      !is_line_end(p[sizeof(keyword) - 1]))) {
    return TrapParse::NONE;
  }
  p += sizeof(keyword) - 1;
  if(!is_space(*p)) return TrapParse::INVALID;
  p = skip_spaces(p);

  usize address = 0;
  usize digits = 0;
  while(p[digits] >= '0' && p[digits] <= '9') {
    const usize digit = (usize) (p[digits] - '0');
    if(address > (core_61::MAX_PROGRAM_STEP - 1U - digit) / 10U) {
      return TrapParse::INVALID;
    }
    address = address * 10U + digit;
    digits++;
  }
  if(digits == 0 || !is_space(p[digits])) return TrapParse::INVALID;
  p = skip_spaces(p + digits);

  static const char run_keyword[] = "run";
  if(strncmp(p, run_keyword, sizeof(run_keyword) - 1) != 0 ||
     !is_space(p[sizeof(run_keyword) - 1])) {
    return TrapParse::INVALID;
  }
  p = skip_spaces(p + sizeof(run_keyword) - 1);
  if(*p != ':') return TrapParse::INVALID;
  p = skip_spaces(p + 1);

  usize label_len = 0;
  while(!is_space(p[label_len]) && !is_line_end(p[label_len])) label_len++;
  if(label_len == 0 || label_len > MAX_LABEL_SIZE ||
     !token_ends(p + label_len)) {
    return TrapParse::INVALID;
  }

  out.address = (u8) address;
  out.label = p;
  out.label_len = label_len;
  return TrapParse::VALID;
}

enum class BindParse : u8 { NONE, VALID, INVALID };

struct ParsedBind {
  u8 opcode;
  const char* label;
  usize label_len;
};

static i8 hex_value(char value) {
  if(value >= '0' && value <= '9') return (i8) (value - '0');
  if(value >= 'A' && value <= 'F') return (i8) (value - 'A' + 10);
  if(value >= 'a' && value <= 'f') return (i8) (value - 'a' + 10);
  return -1;
}

static BindParse parse_bind(const char* line, ParsedBind& out) {
  const char* p = skip_spaces(line);
  static const char keyword[] = "bind";
  if(strncmp(p, keyword, sizeof(keyword) - 1) != 0 ||
     (!is_space(p[sizeof(keyword) - 1]) &&
      !is_line_end(p[sizeof(keyword) - 1]))) {
    return BindParse::NONE;
  }
  p += sizeof(keyword) - 1;
  if(!is_space(*p)) return BindParse::INVALID;
  p = skip_spaces(p);

  if(is_line_end(*p)) return BindParse::INVALID;
  const i8 high = hex_value(*p++);
  if(is_line_end(*p)) return BindParse::INVALID;
  const i8 low = hex_value(*p++);
  if(high < 0 || low < 0 || high > 0x0E || !is_space(*p)) {
    return BindParse::INVALID;
  }
  out.opcode = (u8) (((u8) high << 4) | (u8) low);
  p = skip_spaces(p);

  static const char run_keyword[] = "run";
  if(strncmp(p, run_keyword, sizeof(run_keyword) - 1) != 0 ||
     !is_space(p[sizeof(run_keyword) - 1])) {
    return BindParse::INVALID;
  }
  p = skip_spaces(p + sizeof(run_keyword) - 1);
  if(*p != ':') return BindParse::INVALID;
  p = skip_spaces(p + 1);

  usize label_len = 0;
  while(!is_space(p[label_len]) && !is_line_end(p[label_len])) label_len++;
  if(label_len == 0 || label_len > MAX_LABEL_SIZE ||
     !token_ends(p + label_len)) {
    return BindParse::INVALID;
  }

  out.label = p;
  out.label_len = label_len;
  return BindParse::VALID;
}

static void set_trap_active(u8 address, bool active) {
#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
  active_trap_bit_alias_base()[address] = active ? 1U : 0U;
#else
  const u8 mask = (u8) (1U << (address & 7U));
  if(active) active_traps[address >> 3] |= mask;
  else active_traps[address >> 3] &= (u8) ~mask;
#endif
}

