bolknote/MK61S_MINI/code/m61_text.cpp
static bool trap_is_active(u8 address) {
#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
  return address < TRAP_ADDRESS_COUNT &&
         active_trap_bit_alias_base()[address] != 0;
#else
  return address < TRAP_ADDRESS_COUNT &&
         (active_traps[address >> 3] &
          (u8) (1U << (address & 7U))) != 0;
#endif
}

static bool any_trap_is_active(void) {
  for(u8 i = 0; i < TRAP_BITMAP_SIZE; i++) {
    if(active_traps[i] != 0) return true;
  }
  return false;
}

static bool build_label_index(const char*& error_message, u16& error_line) {
  const u16 resume_pos = script_pos;
  const u16 resume_line = script_line;
  script_pos = 0;
  script_line = 1;
  label_count = 0;
  invalidate_read_cache();

  char line[MAX_LINE_SIZE + 1];
  while(script_pos < script_len) {
    const u16 line_start = script_pos;
    const u16 line_number = script_line;
    if(!read_next_line(line, sizeof(line))) {
      error_message = "cannot read script or line is too long";
      error_line = line_number;
      return false;
    }
    const char* name = NULL;
    usize len = 0;
    const LabelParse parsed = parse_label(line, name, len);
    if(parsed == LabelParse::NONE) continue;
    if(parsed == LabelParse::INVALID) {
      error_message = "invalid label (use 1..31 non-space characters)";
      error_line = line_number;
      return false;
    }
    if(label_count >= MAX_LABELS) {
      error_message = "too many labels (maximum 64)";
      error_line = line_number;
      return false;
    }
    for(u8 i = 0; i < label_count; i++) {
      if(stored_label_equals(labels[i], name, len)) {
        error_message = "duplicate label";
        error_line = line_number;
        return false;
      }
    }

    LabelEntry& entry = labels[label_count++];
    entry.hash = label_hash(name, len);
    entry.name_pos = (u16) (line_start + (u16) (name - line));
    entry.target_pos = script_pos;
    entry.target_line = script_line;
    entry.len = (u8) len;
  }

  script_pos = resume_pos;
  script_line = resume_line;
  invalidate_read_cache();
  return true;
}

static bool build_trap_index(const char*& error_message, u16& error_line) {
  const u16 resume_pos = script_pos;
  const u16 resume_line = script_line;
  script_pos = 0;
  script_line = 1;
  memset(trap_targets, INVALID_TRAP_TARGET, sizeof(trap_targets));
  invalidate_read_cache();

  char line[MAX_LINE_SIZE + 1];
  while(script_pos < script_len) {
    const u16 line_number = script_line;
    if(!read_next_line(line, sizeof(line))) {
      error_message = "cannot read script or line is too long";
      error_line = line_number;
      return false;
    }

    ParsedTrap parsed = {};
    const TrapParse result = parse_trap(line, parsed);
    if(result == TrapParse::NONE) continue;
    if(result == TrapParse::INVALID) {
      error_message = "invalid trap (use: trap <0..111> run :label)";
      error_line = line_number;
      return false;
    }
    if(trap_targets[parsed.address] != INVALID_TRAP_TARGET) {
      error_message = "duplicate trap address";
      error_line = line_number;
      return false;
    }
    const i16 target = find_label_index(parsed.label, parsed.label_len);
    if(target < 0) {
      error_message = "trap label not found";
      error_line = line_number;
      return false;
    }
    trap_targets[parsed.address] = (u8) target;
  }

  script_pos = resume_pos;
  script_line = resume_line;
  invalidate_read_cache();
  return true;
}

static bool build_bind_index(const char*& error_message, u16& error_line) {
  const u16 resume_pos = script_pos;
  const u16 resume_line = script_line;
  script_pos = 0;
  script_line = 1;
  bind_count = 0;
  invalidate_read_cache();

  char line[MAX_LINE_SIZE + 1];
  while(script_pos < script_len) {
    const u16 line_number = script_line;
    if(!read_next_line(line, sizeof(line))) {
      error_message = "cannot read script or line is too long";
      error_line = line_number;
      return false;
    }

    ParsedBind parsed = {};
    const BindParse result = parse_bind(line, parsed);
    if(result == BindParse::NONE) continue;
    if(result == BindParse::INVALID) {
      error_message = "invalid bind (use: bind <00..EF> run :label)";
      error_line = line_number;
      return false;
    }
    if(bind_count >= MAX_BINDS) {
      error_message = "too many binds (maximum 8)";
      error_line = line_number;
      return false;
    }
    if(find_bind_index(parsed.opcode) >= 0) {
      error_message = "duplicate bind opcode";
      error_line = line_number;
      return false;
    }
    const i16 target = find_label_index(parsed.label, parsed.label_len);
    if(target < 0) {
      error_message = "bind label not found";
      error_line = line_number;
      return false;
    }
    binds[bind_count++] = {parsed.opcode, (u8) target};
  }

  script_pos = resume_pos;
  script_line = resume_line;
  invalidate_read_cache();
  return true;
}

static void discard_undefined_active_traps(void) {
  for(u8 address = 0; address < TRAP_ADDRESS_COUNT; address++) {
    if(trap_targets[address] == INVALID_TRAP_TARGET) {
      set_trap_active(address, false);
    }
  }
}

static void discard_undefined_active_binds(void) {
  u8 next = 0;
  for(u8 i = 0; i < MAX_BINDS; i++) {
    const u8 opcode = active_bind_opcodes[i];
    if(opcode == INVALID_BIND_OPCODE || find_bind_index(opcode) < 0) continue;
    bool duplicate = false;
    for(u8 j = 0; j < next; j++) {
      if(active_bind_opcodes[j] == opcode) {
        duplicate = true;
        break;
      }
    }
    if(!duplicate) active_bind_opcodes[next++] = opcode;
  }
  while(next < MAX_BINDS) {
    active_bind_opcodes[next++] = INVALID_BIND_OPCODE;
  }
}

static bool activate_bind(u8 opcode) {
  if(bind_is_active(opcode)) return true;
  for(u8 i = 0; i < MAX_BINDS; i++) {
    if(active_bind_opcodes[i] != INVALID_BIND_OPCODE) continue;
    active_bind_opcodes[i] = opcode;
    if(sync_bind_hooks()) return true;
    active_bind_opcodes[i] = INVALID_BIND_OPCODE;
    (void) sync_bind_hooks();
    return false;
  }
  return false;
}

static bool activate_frame(const ScriptFrame& frame, const char*& error_message, u16& error_line) {
  clear_bind_hooks();
  restore_frame(frame);
  if(!build_label_index(error_message, error_line) ||
     !build_trap_index(error_message, error_line) ||
     !build_bind_index(error_message, error_line)) {
    return false;
  }
  // Повторный запуск того же корневого файла может принести активные биты из
  // предыдущего запуска. Если файл успели переписать, не оставляем адреса,
  // для которых в новой версии уже нет объявления и обработчика.
  discard_undefined_active_traps();
  discard_undefined_active_binds();
  if(!sync_bind_hooks()) {
    error_message = "calculator command hook capacity is exhausted";
    error_line = 0;
    return false;
  }
  return true;
}

static bool restore_return_frame(const ReturnFrame& returned) {
  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(returned.script, error_message, error_line)) {
    fail_script(error_message, error_line);
    return false;
  }
  terminal_script::reset();
  return true;
}

static bool return_from_script(void) {
  if(return_stack_depth == 0) {
    if(any_trap_is_active() || any_bind_is_active()) {
      runner_state = RunnerState::WATCH_EVENTS;
      wait_until_ms = 0;
      return true;
    }
    stop_runner();
    return true;
  }

  const ReturnFrame returned = return_stack[--return_stack_depth];
  if(returned.kind == ReturnKind::BIND) {
    if(!bind_handler_active) {
      fail_script("bind handler context is unavailable", script_line);
      return false;
    }
    if(!restore_return_frame(returned)) return false;
    bind_handler_active = false;
    runner_state = returned.runner_state;
    if(runner_state == RunnerState::WATCH_EVENTS &&
       !any_trap_is_active() && !any_bind_is_active()) {
      stop_runner();
    }
    return true;
  }

  if(returned.kind != ReturnKind::TRAP) {
    if(returned.kind == ReturnKind::SCRIPT && script_stack_depth > 0) {
      script_stack_depth--;
    }
    if(!restore_return_frame(returned)) return false;
    runner_state = returned.runner_state;
    return true;
  }

