bolknote/MK61S_MINI/code/m61_text.cpp
  if(!trap_context_valid || !restore_trap_context()) {
    fail_script("cannot restore calculator trap context", script_line);
    return false;
  }
  trap_context_valid = false;
  bypass_trap_once = true;
  bypass_trap_address = suspended_trap_address;
  suspended_trap_address = 0;
  if(!restore_return_frame(returned)) return false;
  runner_state = returned.runner_state;
  return true;
}

static void finish_script(void) {
  if(return_stack_depth > 0) {
    const ReturnKind kind = return_stack[return_stack_depth - 1].kind;
    if(kind == ReturnKind::TRAP) {
      fail_script("trap handler reached end of script without ret", script_line);
      return;
    }
    if(kind == ReturnKind::BIND) {
      fail_script("bind handler reached end of script without ret", script_line);
      return;
    }
  }
  (void) return_from_script();
}

static bool open_store_script(const char* name) {
  ScriptFrame child;
  if(!make_store_frame(name, child)) return false;
  if(!push_current_frame(ReturnKind::SCRIPT)) return false;

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(child, error_message, error_line)) {
    const ReturnFrame parent = return_stack[--return_stack_depth];
    if(script_stack_depth > 0) script_stack_depth--;
    restore_frame(parent.script);
    return false;
  }
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool open_store_script(u16 id) {
  ScriptFrame child;
  if(!make_store_frame(id, child)) return false;
  if(!push_current_frame(ReturnKind::SCRIPT)) return false;

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(child, error_message, error_line)) {
    const ReturnFrame parent = return_stack[--return_stack_depth];
    if(script_stack_depth > 0) script_stack_depth--;
    restore_frame(parent.script);
    return false;
  }
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  return true;
}

// Запуск загруженной программы прямо на ядре, ожидание останова — асинхронно
// из service(). Клавиши через буфер клавиатуры терялись бы при выходе из меню.
static bool start_current_program(void) {
  if(trap_context_valid) return false;
  const usize steps = core_61::program_steps();
  for(u8 address = 0; address < TRAP_ADDRESS_COUNT; address++) {
    if(trap_is_active(address) && address >= steps) return false;
  }
  runner_state = RunnerState::WAIT_RUN_STOP;
  // Взводим исполнитель до последнего скрытого шага С/П: один шаг ядра может
  // дойти до первого кода программы, особенно в турбо-сборках.
  hidden_start_loaded_program();
  return true;
}

// "load N" внутри сценария: слот выполняется как вложенный скрипт с возвратом
// на следующую строку (Load() терминала отменил бы текущий сценарий).
static bool open_slot(const char* args) {
  args = skip_spaces(args);
  usize slot = 0;
  usize digits = 0;
  while(args[digits] >= '0' && args[digits] <= '9') {
    slot = slot * 10 + (usize) (args[digits] - '0');
    digits++;
  }
  if(digits == 0 || slot > 99 || !token_ends(args + digits)) return false;

  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) slot);
  return open_store_script(name);
}

// В обычном сценарии "run :метка" остаётся переходом и поддерживает циклы.
// В обработчике trap или bind это локальный вызов: ret возвращает на строку
// после run, что позволяет вынести общий код кадра в одну метку.
static bool goto_label(const char* args) {
  args = skip_spaces(args);
  usize label_len = 0;
  while(!is_line_end(args[label_len]) && !is_space(args[label_len])) label_len++;
  if(label_len == 0 || label_len > MAX_LABEL_SIZE || !token_ends(args + label_len)) return false;

  const i16 target = find_label_index(args, label_len);
  if(target < 0) return false;
  if((trap_context_valid || bind_handler_active) &&
     !push_current_frame(ReturnKind::LABEL)) {
    line_error_message = "label return stack is full";
    return false;
  }
  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  return true;
}

static void bind_command_hook(
    core_61::Mk61CommandHookContext& context, void* user_data) {
  (void) user_data;
  if(context.source != core_61::Mk61CommandSource::KEYBOARD) return;

  if(context.phase == core_61::Mk61CommandHookPhase::AFTER_EXECUTE) {
    if(bind_pending && context.sequence == pending_bind_sequence) {
      bind_ready = true;
    }
    return;
  }

  if(context.phase != core_61::Mk61CommandHookPhase::BEFORE_EXECUTE ||
     runner_state != RunnerState::WATCH_EVENTS ||
     bind_handler_active || bind_pending ||
     !bind_is_active(context.opcode)) {
    return;
  }

  const i16 bind_index = find_bind_index(context.opcode);
  if(bind_index < 0 || binds[bind_index].target >= label_count) return;

  pending_bind_target = binds[bind_index].target;
  pending_bind_sequence = context.sequence;
  bind_pending = true;
  bind_ready = false;
  // bind является горячей клавишей, а не наблюдателем: исходная операция
  // калькулятора поглощается, но завершает штатный клавиатурный цикл через NOP.
  context.replacement_opcode = (u8) MK61_NOP;
}

static bool enter_pending_bind(void) {
  if(!bind_pending || !bind_ready ||
     pending_bind_target >= label_count) {
    return false;
  }
  const u8 target = pending_bind_target;
  if(!push_current_frame(ReturnKind::BIND)) {
    line_error_message = "bind return stack is full";
    return false;
  }

  bind_pending = false;
  bind_ready = false;
  pending_bind_target = INVALID_BIND_TARGET;
  pending_bind_sequence = 0;
  bind_handler_active = true;

  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool program_boundary_hook(
    const core_61::Mk61ProgramBoundaryContext& context, void* user_data) {
  if((runner_state != RunnerState::WAIT_RUN_STOP &&
      runner_state != RunnerState::WATCH_EVENTS) ||
     !core_61::is_RUN()) {
    return false;
  }

  if(bypass_trap_once) {
    const bool bypass = context.address == bypass_trap_address;
    bypass_trap_once = false;
    if(bypass) return false;
  }

