bolknote/MK61S_MINI/code/m61_text.cpp
#if MK61_STM32_SRAM_BIT_BAND_AVAILABLE
  const volatile u32* active_bits =
      reinterpret_cast<volatile u32*>(user_data);
  if(context.address >= TRAP_ADDRESS_COUNT ||
     active_bits[context.address] == 0) return false;
#else
  (void) user_data;
  if(!trap_is_active(context.address)) return false;
#endif
  const u8 target = trap_targets[context.address];
  if(target == INVALID_TRAP_TARGET || target >= label_count) return false;
  trap_pending = true;
  pending_trap_address = context.address;
  pending_trap_target = target;
  return true;
}

static bool enter_pending_trap(void) {
  if(!trap_pending || pending_trap_target >= label_count) return false;
  const u8 address = pending_trap_address;
  const u8 target = pending_trap_target;

  if(!push_current_frame(ReturnKind::TRAP)) {
    line_error_message = "trap return stack is full";
    return false;
  }
  if(!core_61::save_context(trap_context)) {
    return_stack_depth--;
    line_error_message = "cannot save calculator trap context";
    return false;
  }

  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  trap_context_valid = true;
  suspended_trap_address = address;

  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool open_referenced_file(const char* path) {
#ifndef M61_TEXT_HOST_TEST
  u16 cwd = program_store::ROOT_ID;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) cwd = current.parent_id;
  }

  program_store::Entry entry;
  if(storage_path::resolve_file(cwd, path, entry) ==
     storage_path::Status::OK) {
    return OpenStoredEntry(entry);
  }
  // Совместимость со старыми сценариями без каталогов: простое имя, которого
  // нет рядом с вызывающим сценарием, всё ещё может обозначать файл в корне.
  // Для явно относительных путей переход к несвязанному объекту запрещён.
  return cwd != program_store::ROOT_ID && strchr(path, '/') == NULL &&
         strchr(path, '\\') == NULL &&
         storage_path::resolve_file(program_store::ROOT_ID, path, entry) ==
             storage_path::Status::OK &&
         OpenStoredEntry(entry);
#else
  return OpenStoredFile(path);
#endif
}

static void clear_frame_handlers(ScriptFrame& frame) {
  memset(frame.active_traps, 0, sizeof(frame.active_traps));
  memset(frame.active_bind_opcodes, INVALID_BIND_OPCODE,
         sizeof(frame.active_bind_opcodes));
}

static void clear_active_handlers(void) {
  clear_bind_hooks();
  clear_active_traps();
  clear_active_binds();
  for(u8 i = 0; i < return_stack_depth; i++) {
    clear_frame_handlers(return_stack[i].script);
  }

  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  bypass_trap_once = false;
  bypass_trap_address = 0;
  bind_pending = false;
  bind_ready = false;
  pending_bind_target = INVALID_BIND_TARGET;
  pending_bind_sequence = 0;
}

// Вся грамматика команд разбирается терминалом (единый диспетчер интерактивного
// и скриптового режимов). Сценарию терминал возвращает только действия,
// влияющие на поток выполнения: run, open, load, переходы по меткам и reinit.
static bool execute_script_line(const char* raw_line) {
  line_error_message = NULL;
  const char* line = skip_spaces(raw_line);
  if(is_line_end(*line)) return true;
  if(*line == ':') return true; // Метка — точка перехода, сама по себе ничего не делает

  ParsedTrap parsed_trap = {};
  const TrapParse trap_result = parse_trap(line, parsed_trap);
  if(trap_result == TrapParse::VALID) {
    set_trap_active(parsed_trap.address, true);
    return true;
  }
  if(trap_result == TrapParse::INVALID) {
    line_error_message = "invalid trap (use: trap <0..111> run :label)";
    return false;
  }

  ParsedBind parsed_bind = {};
  const BindParse bind_result = parse_bind(line, parsed_bind);
  if(bind_result == BindParse::VALID) {
    if(activate_bind(parsed_bind.opcode)) return true;
    line_error_message = "cannot activate bind command hooks";
    return false;
  }
  if(bind_result == BindParse::INVALID) {
    line_error_message = "invalid bind (use: bind <00..EF> run :label)";
    return false;
  }

  const terminal_protocol::Result result =
      terminal_script::execute(line, trap_context_valid);
  switch(result.kind) {
    case terminal_protocol::ResultKind::OK:
      return true;
    case terminal_protocol::ResultKind::RUN_PROGRAM:
      if(start_current_program()) return true;
      line_error_message = trap_context_valid
          ? "cannot run calculator from a trap handler"
          : "active trap address is outside current program memory";
      return false;
    case terminal_protocol::ResultKind::OPEN_FILE:
      if(open_referenced_file(result.args)) return true;
      line_error_message = "cannot open referenced file";
      return false;
    case terminal_protocol::ResultKind::LOAD_SLOT:
      if(open_slot(result.args)) return true;
      line_error_message = "cannot load nested slot";
      return false;
    case terminal_protocol::ResultKind::GOTO_LABEL:
      if(goto_label(result.args)) return true;
      line_error_message = "label not found or invalid";
      return false;
    case terminal_protocol::ResultKind::WAIT:
      if(result.key <= 0 || result.key > 60000) {
        line_error_message = "invalid wait duration";
        return false;
      }
      wait_until_ms = runner_millis() + (u32) result.key;
      runner_state = RunnerState::WAIT_TIME;
      return true;
    case terminal_protocol::ResultKind::RETURN_SCRIPT:
      return return_from_script();
    case terminal_protocol::ResultKind::REINIT_CALCULATOR:
      if(trap_context_valid) {
        line_error_message = "reinit is not allowed in a trap handler";
        return false;
      }
      clear_active_handlers();
      display_claimed = false;
      reinit_mk61_calculator_state();
      return true;
    case terminal_protocol::ResultKind::ERROR:
    case terminal_protocol::ResultKind::KEY:
      line_error_message = "terminal command failed";
      return false;
  }
  return false;
}

